In [51]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

In [52]:
#load the dataset
data=pd.read_csv('car-sales.csv')

In [53]:
data.shape

(10, 5)

In [54]:
data.describe(include='all')

          Make Colour  Odometer (KM)      Doors      Price
count       10     10      10.000000  10.000000         10
unique       4      5            NaN        NaN          9
top     Toyota  White            NaN        NaN  $7,000.00
freq         4      4            NaN        NaN          2
mean       NaN    NaN   78601.400000   4.000000        NaN
std        NaN    NaN   61983.471735   0.471405        NaN
min        NaN    NaN   11179.000000   3.000000        NaN
25%        NaN    NaN   35836.250000   4.000000        NaN
50%        NaN    NaN   57369.000000   4.000000        NaN
75%        NaN    NaN   96384.500000   4.000000        NaN
max        NaN    NaN  213095.000000   5.000000        NaN

In [55]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
Make             10 non-null object
Colour           10 non-null object
Odometer (KM)    10 non-null int64
Doors            10 non-null int64
Price            10 non-null object
dtypes: int64(2), object(3)
memory usage: 480.0+ bytes

In [56]:
from sklearn.preprocessing import LabelEncoder
label_data=LabelEncoder()
data['Make']=label_data.fit_transform(data['Make'])
data['Colour']=label_data.fit_transform(data['Colour'])

In [57]:
data

   Make  Colour  Odometer (KM)  Doors       Price
0     3       4         150043      4   $4,000.00
1     1       3          87899      4   $5,000.00
2     3       1          32549      3   $7,000.00
3     0       0          11179      5  $22,000.00
4     2       4         213095      4   $3,500.00
5     3       2          99213      4   $4,500.00
6     1       1          45698      4   $7,500.00
7     1       1          54738      4   $7,000.00
8     3       4          60000      4   $6,250.00
9     2       4          31600      4   $9,700.00

In [59]:
data['Price']=data['Price'].str.replace('$','')
data['Price']=data['Price']. str.replace(',','')
data

   Make  Colour  Odometer (KM)  Doors     Price
0     3       4         150043      4   4000.00
1     1       3          87899      4   5000.00
2     3       1          32549      3   7000.00
3     0       0          11179      5  22000.00
4     2       4         213095      4   3500.00
5     3       2          99213      4   4500.00
6     1       1          45698      4   7500.00
7     1       1          54738      4   7000.00
8     3       4          60000      4   6250.00
9     2       4          31600      4   9700.00

In [61]:
x=data.drop(columns='Price')
y=data['Price']

In [65]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.80,random_state=42)
x_train
y_train

3    22000.00
6     7500.00
Name: Price, dtype: object

In [63]:
from sklearn.linear_model import LinearRegression
model=LinearRegression()
model.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [69]:
model.intercept_

26695.834105611368

In [70]:
model.coef_

array([-1.21689075e-05, -1.21689075e-05, -4.20058517e-01,  1.21689075e-05])

In [71]:
model.rank_

1

In [72]:
import pickle

In [73]:
filename="model.pkl"
pickle.dump(model,open(filename,'wb'))